namespace GroupBot.Shared;

public class Participant
{
    public Participant(long id, string name)
    {
        Id = id;
        Name = name;
    }

    public long Id { get; set; }
    public string Name { get; set; }
}

public static class ParticipantsContainer
{
    static ParticipantsContainer()
    {
        Participants = new List<Participant>
        {
            new(6446112154, "Федоров Федор Федорович"),
            new(1332748043, "Авруцкий Игорь Алексеевич"),
            new(1484894336, "Антощенко Роман Дмитриевич"),
            new(1328197458, "Веселовская Анастасия Евгеньевна"),
            new(1091332358, "Гущина Анастасия Евгеньевна"),
            new(618211233, "Жидков Александр Владимирович"),
            new(388270630, "Зезюльчик Богдан Сергеевич"),
            new(1805382114, "Козаков Антон Михайлович"),
            new(278414764, "Кочкин Кирилл Алексеевич"),
            new(404350103, "Красноштанова Юлия Николаевна"),
            new(156420710, "Курилин Тимофей Ильич"),
            new(907373368, "Моданов Егор Вениаминович"),
            new(995379393, "Моломожнов Никита Владимирович"),
            new(5976743802, "Пак Ольга Алексеевна"),
            new(927725485, "Панченко Никита Юрьевич"),
            new(1646132971, "Праздников Максим Кириллович"),
            new(1322633448, "Сафонов Артемий Евгеньевич"),
            new(764574929, "Сиротина Елизавета Алексеевна"),
            new(6145602561, "Соколов Михаил Сергеевич"),
            new(865658978, "Сыромятников Аристарх Алексеевич"),
            new(1012726653, "Тевелев Артём Дмитриевич"),
            new(840033883, "Трембач Антонина Андреевна"),
            new(1140118226, "Фисун Кирилл Сергеевич"),
            new(911883319, "Шпак Александр Юрьевич"),
            new(5530967595, "Эроглу Эмре Джан"),
            new(2018280533, "Юдинцев Ян Сергеевич")
        };
    }

    public static List<Participant> Participants { get; }
}